import regex


text = "01.01.2020\n01.01.20\n 01-01-2020\n01-01-20\n01_02_846\n1 января 2020\n1 января\n" \
        "первое января 2020\nпервое января\nпервого января\nпервому января\n"

numbers = r"(?:перв|втор|треть|четверт|пят|шест|седьм|восьм|девят|десят)"
months = r"(?:января|февраля|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря)"

reg = r'(?:\d{2}[.\-_]\d{2}[.\-_]\d{2,4}|(?:\d{1,2}|' + numbers + r'\w{1,3})\s' + months + r'(?:\s\d{2,4})?)'
print(reg)
ans = regex.findall(reg, text)

print(ans)